Revit 2027 API
BuiltInFailures.RoomFailures.RoomHeightNegative Property
 [Room] must have a height greater than 0.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static FailureDefinitionId RoomHeightNegative { get; }
Public Shared ReadOnly Property RoomHeightNegative As FailureDefinitionId
	Get
public:
static property FailureDefinitionId^ RoomHeightNegative {
	FailureDefinitionId^ get ();
}
static member RoomHeightNegative : FailureDefinitionId with get
Property Value
FailureDefinitionId
See Also
Reference
BuiltInFailures.RoomFailures Class
Autodesk.Revit.DB Namespace